### Terraform plan for prod
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.azurerm_client_config.current: Reading...
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg]
azurerm_app_service_plan.default: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan]
azurerm_app_service.website: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-website]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01Mjc2MDI3Zi02MWZiLTRmNmEtYTJiYi1iZjI5NTkyOGVjYjk7b2JqZWN0SWQ9ZTRkNTVmOGUtZDBlMC00NjMxLTkxOWUtZjczMWNmMjIyYmVhO3N1YnNjcmlwdGlvbklkPWM1N2MyYTAyLTI5N2QtNGY2OC05NzliLTE5NjBkZjcyMjYyNzt0ZW5hbnRJZD1lNjdjMTU4OS00NzQ3LTRiNzMtYjdiYi1kYTFiNTY3ZWUxZjU=]
azurerm_app_service.api: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-api]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_app_service.api will be destroyed
  # (because azurerm_app_service.api is not in configuration)
  - resource "azurerm_app_service" "api" {
      - app_service_plan_id               = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan" -> null
      - app_settings                      = {} -> null
      - client_affinity_enabled           = false -> null
      - client_cert_enabled               = false -> null
      - client_cert_mode                  = "Required" -> null
      - custom_domain_verification_id     = "07DB0791BDA37D978A8998D569DEC5B13A26C980879CB8B137452713E322E275" -> null
      - default_site_hostname             = "os-onlinestore-prod-api.azurewebsites.net" -> null
      - enabled                           = true -> null
      - https_only                        = false -> null
      - id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-api" -> null
      - key_vault_reference_identity_id   = "SystemAssigned" -> null
      - location                          = "eastus" -> null
      - name                              = "os-onlinestore-prod-api" -> null
      - outbound_ip_address_list          = [
          - "20.75.218.99",
          - "20.75.218.117",
          - "20.75.218.162",
          - "20.75.218.165",
          - "20.75.218.173",
          - "20.75.218.176",
          - "20.49.104.57",
        ] -> null
      - outbound_ip_addresses             = "20.75.218.99,20.75.218.117,20.75.218.162,20.75.218.165,20.75.218.173,20.75.218.176,20.49.104.57" -> null
      - possible_outbound_ip_address_list = [
          - "20.75.218.99",
          - "20.75.218.117",
          - "20.75.218.162",
          - "20.75.218.165",
          - "20.75.218.173",
          - "20.75.218.176",
          - "20.75.218.178",
          - "20.75.218.183",
          - "20.75.218.186",
          - "20.72.171.55",
          - "20.75.218.191",
          - "20.72.174.14",
          - "20.75.218.210",
          - "20.75.218.225",
          - "20.75.218.234",
          - "20.75.218.246",
          - "20.75.219.3",
          - "20.75.219.4",
          - "52.151.211.88",
          - "20.75.219.15",
          - "20.75.219.22",
          - "20.75.218.39",
          - "20.75.216.39",
          - "20.75.219.28",
          - "20.75.219.30",
          - "20.75.219.36",
          - "20.75.219.40",
          - "20.75.219.58",
          - "40.76.166.51",
          - "20.75.217.9",
          - "20.49.104.57",
        ] -> null
      - possible_outbound_ip_addresses    = "20.75.218.99,20.75.218.117,20.75.218.162,20.75.218.165,20.75.218.173,20.75.218.176,20.75.218.178,20.75.218.183,20.75.218.186,20.72.171.55,20.75.218.191,20.72.174.14,20.75.218.210,20.75.218.225,20.75.218.234,20.75.218.246,20.75.219.3,20.75.219.4,52.151.211.88,20.75.219.15,20.75.219.22,20.75.218.39,20.75.216.39,20.75.219.28,20.75.219.30,20.75.219.36,20.75.219.40,20.75.219.58,40.76.166.51,20.75.217.9,20.49.104.57" -> null
      - resource_group_name               = "onlinestore-prod-rg" -> null
      - site_credential                   = [
          - {
              - password = "vrRQJndJcYq2WFApZ3EZddYXHpSlnHqwDbC5rxSYm1fjLNHvXhebnobD2rEQ"
              - username = "$os-onlinestore-prod-api"
            },
        ] -> null
      - tags                              = {} -> null

      - auth_settings {
          - additional_login_params        = {} -> null
          - allowed_external_redirect_urls = [] -> null
          - enabled                        = false -> null
          - token_refresh_extension_hours  = 0 -> null
          - token_store_enabled            = false -> null
        }

      - identity {
          - identity_ids = [] -> null
          - principal_id = "7db9c3cc-b0f8-4568-bdcb-f7ef4a767f17" -> null
          - tenant_id    = "e67c1589-4747-4b73-b7bb-da1b567ee1f5" -> null
          - type         = "SystemAssigned" -> null
        }

      - logs {
          - detailed_error_messages_enabled = false -> null
          - failed_request_tracing_enabled  = false -> null

          - application_logs {
              - file_system_level = "Off" -> null
            }

          - http_logs {
            }
        }

      - site_config {
          - acr_use_managed_identity_credentials = false -> null
          - always_on                            = false -> null
          - default_documents                    = [
              - "index.html",
            ] -> null
          - dotnet_framework_version             = "v6.0" -> null
          - ftps_state                           = "AllAllowed" -> null
          - http2_enabled                        = false -> null
          - ip_restriction                       = [] -> null
          - local_mysql_enabled                  = false -> null
          - managed_pipeline_mode                = "Integrated" -> null
          - min_tls_version                      = "1.2" -> null
          - number_of_workers                    = 1 -> null
          - remote_debugging_enabled             = false -> null
          - scm_ip_restriction                   = [] -> null
          - scm_type                             = "None" -> null
          - scm_use_main_ip_restriction          = false -> null
          - use_32_bit_worker_process            = true -> null
          - vnet_route_all_enabled               = false -> null
          - websockets_enabled                   = false -> null

          - cors {
              - allowed_origins     = [] -> null
              - support_credentials = false -> null
            }
        }

      - source_control {
          - branch             = "main" -> null
          - manual_integration = false -> null
          - rollback_enabled   = false -> null
          - use_mercurial      = false -> null
        }
    }

  # azurerm_app_service.website will be destroyed
  # (because azurerm_app_service.website is not in configuration)
  - resource "azurerm_app_service" "website" {
      - app_service_plan_id               = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan" -> null
      - app_settings                      = {} -> null
      - client_affinity_enabled           = false -> null
      - client_cert_enabled               = false -> null
      - client_cert_mode                  = "Required" -> null
      - custom_domain_verification_id     = "07DB0791BDA37D978A8998D569DEC5B13A26C980879CB8B137452713E322E275" -> null
      - default_site_hostname             = "os-onlinestore-prod-website.azurewebsites.net" -> null
      - enabled                           = true -> null
      - https_only                        = false -> null
      - id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-website" -> null
      - key_vault_reference_identity_id   = "SystemAssigned" -> null
      - location                          = "eastus" -> null
      - name                              = "os-onlinestore-prod-website" -> null
      - outbound_ip_address_list          = [
          - "20.75.218.99",
          - "20.75.218.117",
          - "20.75.218.162",
          - "20.75.218.165",
          - "20.75.218.173",
          - "20.75.218.176",
          - "20.49.104.57",
        ] -> null
      - outbound_ip_addresses             = "20.75.218.99,20.75.218.117,20.75.218.162,20.75.218.165,20.75.218.173,20.75.218.176,20.49.104.57" -> null
      - possible_outbound_ip_address_list = [
          - "20.75.218.99",
          - "20.75.218.117",
          - "20.75.218.162",
          - "20.75.218.165",
          - "20.75.218.173",
          - "20.75.218.176",
          - "20.75.218.178",
          - "20.75.218.183",
          - "20.75.218.186",
          - "20.72.171.55",
          - "20.75.218.191",
          - "20.72.174.14",
          - "20.75.218.210",
          - "20.75.218.225",
          - "20.75.218.234",
          - "20.75.218.246",
          - "20.75.219.3",
          - "20.75.219.4",
          - "52.151.211.88",
          - "20.75.219.15",
          - "20.75.219.22",
          - "20.75.218.39",
          - "20.75.216.39",
          - "20.75.219.28",
          - "20.75.219.30",
          - "20.75.219.36",
          - "20.75.219.40",
          - "20.75.219.58",
          - "40.76.166.51",
          - "20.75.217.9",
          - "20.49.104.57",
        ] -> null
      - possible_outbound_ip_addresses    = "20.75.218.99,20.75.218.117,20.75.218.162,20.75.218.165,20.75.218.173,20.75.218.176,20.75.218.178,20.75.218.183,20.75.218.186,20.72.171.55,20.75.218.191,20.72.174.14,20.75.218.210,20.75.218.225,20.75.218.234,20.75.218.246,20.75.219.3,20.75.219.4,52.151.211.88,20.75.219.15,20.75.219.22,20.75.218.39,20.75.216.39,20.75.219.28,20.75.219.30,20.75.219.36,20.75.219.40,20.75.219.58,40.76.166.51,20.75.217.9,20.49.104.57" -> null
      - resource_group_name               = "onlinestore-prod-rg" -> null
      - site_credential                   = [
          - {
              - password = "hXAcqFri25evje83t1R4EC7ptegLZnhllL5vPnYcpKWrN5BAgg2urqveQRhl"
              - username = "$os-onlinestore-prod-website"
            },
        ] -> null
      - tags                              = {} -> null

      - auth_settings {
          - additional_login_params        = {} -> null
          - allowed_external_redirect_urls = [] -> null
          - enabled                        = false -> null
          - token_refresh_extension_hours  = 0 -> null
          - token_store_enabled            = false -> null
        }

      - identity {
          - identity_ids = [] -> null
          - principal_id = "9aeb87ac-0259-4149-b54b-ae0a1f3c4ad9" -> null
          - tenant_id    = "e67c1589-4747-4b73-b7bb-da1b567ee1f5" -> null
          - type         = "SystemAssigned" -> null
        }

      - logs {
          - detailed_error_messages_enabled = false -> null
          - failed_request_tracing_enabled  = false -> null

          - application_logs {
              - file_system_level = "Off" -> null
            }

          - http_logs {
            }
        }

      - site_config {
          - acr_use_managed_identity_credentials = false -> null
          - always_on                            = false -> null
          - default_documents                    = [
              - "index.html",
            ] -> null
          - dotnet_framework_version             = "v6.0" -> null
          - ftps_state                           = "AllAllowed" -> null
          - http2_enabled                        = false -> null
          - ip_restriction                       = [] -> null
          - local_mysql_enabled                  = false -> null
          - managed_pipeline_mode                = "Integrated" -> null
          - min_tls_version                      = "1.2" -> null
          - number_of_workers                    = 1 -> null
          - remote_debugging_enabled             = false -> null
          - scm_ip_restriction                   = [] -> null
          - scm_type                             = "None" -> null
          - scm_use_main_ip_restriction          = false -> null
          - use_32_bit_worker_process            = true -> null
          - vnet_route_all_enabled               = false -> null
          - websockets_enabled                   = false -> null

          - cors {
              - allowed_origins     = [] -> null
              - support_credentials = false -> null
            }
        }

      - source_control {
          - branch             = "main" -> null
          - manual_integration = false -> null
          - rollback_enabled   = false -> null
          - use_mercurial      = false -> null
        }
    }

  # azurerm_app_service_plan.default will be destroyed
  # (because azurerm_app_service_plan.default is not in configuration)
  - resource "azurerm_app_service_plan" "default" {
      - id                           = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverfarms/onlinestore-plan" -> null
      - is_xenon                     = false -> null
      - kind                         = "Windows" -> null
      - location                     = "eastus" -> null
      - maximum_elastic_worker_count = 1 -> null
      - maximum_number_of_workers    = 1 -> null
      - name                         = "onlinestore-plan" -> null
      - per_site_scaling             = false -> null
      - reserved                     = false -> null
      - resource_group_name          = "onlinestore-prod-rg" -> null
      - tags                         = {} -> null
      - zone_redundant               = false -> null

      - sku {
          - capacity = 0 -> null
          - size     = "F1" -> null
          - tier     = "Free" -> null
        }
    }

  # azurerm_service_plan.windows will be created
  + resource "azurerm_service_plan" "windows" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "onlinestore-plan-windows"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "onlinestore-prod-rg"
      + sku_name                     = "F1"
      + worker_count                 = (known after apply)
    }

  # azurerm_windows_web_app.api will be created
  + resource "azurerm_windows_web_app" "api" {
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "eastus"
      + name                              = "os-onlinestore-prod-api"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "onlinestore-prod-rg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + zip_deploy_file                   = (known after apply)

      + auth_settings {
          + additional_login_parameters    = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences          = (known after apply)
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
            }

          + facebook {
              + app_id                  = (known after apply)
              + app_secret              = (sensitive value)
              + app_secret_setting_name = (known after apply)
              + oauth_scopes            = (known after apply)
            }

          + github {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + google {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + microsoft {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + twitter {
              + consumer_key                 = (known after apply)
              + consumer_secret              = (sensitive value)
              + consumer_secret_setting_name = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = false
          + auto_heal_enabled                       = false
          + container_registry_use_managed_identity = false
          + default_documents                       = [
              + "index.html",
            ]
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction                          = (known after apply)
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + windows_fx_version                      = (known after apply)
          + worker_count                            = (known after apply)

          + application_stack {
              + current_stack                = "dotnet"
              + dotnet_version               = "v6.0"
              + java_embedded_server_enabled = (known after apply)
              + php_version                  = (known after apply)
              + python                       = false
              + python_version               = (known after apply)
            }
        }
    }

  # azurerm_windows_web_app.website will be created
  + resource "azurerm_windows_web_app" "website" {
      + client_affinity_enabled           = false
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Required"
      + custom_domain_verification_id     = (sensitive value)
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "eastus"
      + name                              = "os-onlinestore-prod-website"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "onlinestore-prod-rg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (known after apply)
      + zip_deploy_file                   = (known after apply)

      + auth_settings {
          + additional_login_parameters    = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences          = (known after apply)
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
            }

          + facebook {
              + app_id                  = (known after apply)
              + app_secret              = (sensitive value)
              + app_secret_setting_name = (known after apply)
              + oauth_scopes            = (known after apply)
            }

          + github {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + google {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + microsoft {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + twitter {
              + consumer_key                 = (known after apply)
              + consumer_secret              = (sensitive value)
              + consumer_secret_setting_name = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = false
          + auto_heal_enabled                       = false
          + container_registry_use_managed_identity = false
          + default_documents                       = [
              + "index.html",
            ]
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction                          = (known after apply)
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction                      = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + windows_fx_version                      = (known after apply)
          + worker_count                            = (known after apply)

          + application_stack {
              + current_stack                = "dotnet"
              + dotnet_version               = "v6.0"
              + java_embedded_server_enabled = (known after apply)
              + php_version                  = (known after apply)
              + python                       = false
              + python_version               = (known after apply)
            }
        }
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @benchiverton, Action: `pull_request`, Working Directory: ``, Workflow: `Plan - prod`*